Revit 2027 API
Space.DesignSupplyAirflow Property
Get or set the Specified Supply Airflow of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DesignSupplyAirflow { get; set; }
Public Property DesignSupplyAirflow As Double
	Get
	Set
public:
property double DesignSupplyAirflow {
	double get ();
	void set (double value);
}
member DesignSupplyAirflow : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Specified Supply Airflow (Unit: CFM) of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace